[
    {
        "name":"Difference between SQL and NoSQL",
        "ans":"SQL is the programming language used to interface with relational databases.NoSQL is a class of DBMs that are non-relational and generally do not use SQL.There are many practical differences between SQL and NoSQL. They are, Language, Scalability, structure, Properties. SQL is Safe and versatile, it's particularly well suited for complex queries. However, SQL restricts the user to working within a predefined tabular schema, and more care must be taken to organize and understand the data before it is used.The dynamic schemata of NoSQL databases allow representation of alternative structures, often alongside each other, encouraging greater flexibility. Like NoSQL, SQL databases can be scaled horizontally.NoSQL technologies are diverse and while many rely on the master-slave architecture, options for scaling vertically also exist. SQL Have Atomicity, Consistency, Isoletion, Durabilty. OtherWiser, NoSQL has Consistency, Availability, Pertiotion tolarence. Also SQL databases represent massive communities, stable codebases, and proven standards. Multitudes of examples are posted online and experts are available to support those new to programming relational data.NoSQL technologies are being adopted quickly, but communities remain smaller and more fractured. However, many SQL languages are proprietary or associated with large single-vendors, while NoSQL communities benefit from open systems and concerted commitment to onboarding users.",
        "img":"https://media.geeksforgeeks.org/wp-content/cdn-uploads/20191104165821/SQL-Vs-NoSQL1.png  ",
        "time":"2022-11-10T14:05:45.853Z"

    },
    {
        "name":"What is JWT, and how does it work?",
        "ans":"JWT, or JSON Web Token, is an open standard used to share security information between two parties — a client and a server. Each JWT contains encoded JSON objects, including a set of claims. JWTs are signed using a cryptographic algorithm to ensure that the claims cannot be altered after the token is issued.A JWT is a string made up of three parts, separated by dots (.), and serialized using base64. In the most common serialization format, compact serialization, the JWT looks something like this: xxxxx.yyyyy.zzzzz.Once decoded, you will get three JSON strings. They are Header, Payload, Signature.The JOSE (JSON Object Signing and Encryption) header contains the type of token — JWT in this case — and the signing algorithm.The payload contains the claims. This is displayed as a JSON string, usually containing no more than a dozen fields to keep the JWT compact. This information is typically used by the server to verify that the user has permission to perform the action they are requesting.The signature ensures that the token hasn't been altered. The party that creates the JWT signs the header and payload with a secret that is known to both the issuer and receiver, or with a private key known only to the sender. When the token is used, the receiving party verifies that the header and payload match the signature. ",
        "img":"https://miro.medium.com/max/1000/1*YguJreMramdggBXl0QNIqw.png",
        "time":"2022-19-10T14:05:45.853Z"
    },
    {
        "name":"What is the difference between javascript and NodeJS?",
        "ans":"First OF all NodeJS is a cross-platform and opensource Javascript runtime environment that allows the javascript to be run on the server-side. Nodejs allows Javascript code to run outside the browser. Nodejs comes with a lot of modules and mostly used in web development. And Javascript is a Scripting language. It is mostly abbreviated as JS. It can be said that Javascript is the updated version of the ECMA script. Javascript is a high-level programming language that uses the concept of Oops but it is based on prototype inheritance. Javascript can only be run in the browsers and also can run outside of the browser with the help of Node js.Javascript can run in any browser engine as like JS core in safari and Spidermonkey in Firefox. V8 is the Javascript engine inside of node.js that parses and runs Javascript.  JS is only for client site and Node js only for server side.Javascript can only be run in the browsers.Some of the Nodejs modules are Lodash, express etc. These modules are to be imported from npm.Some of the javascript frameworks are RamdaJS, TypedJS, etc.  ",
        "img":"https://static.javatpoint.com/javascriptpages/images/javascript-vs-nodejs.png",
        "time":"2022-12-10T14:05:45.853Z"
    },
    {
        "name":"How does NodeJS handle multiple requests at the same time?",
        "ans":"We know NodeJS application is single-threaded. Say, if processing involves request A that takes 10 seconds, it does not mean that a request which comes after this request needs to wait 10 seconds to start processing because NodeJS event loops are only single-threaded.NodeJS receives multiple client requests and places them into EventQueue. NodeJS is built with the concept of event-driven architecture. NodeJS has its own EventLoop which is an infinite loop that receives requests and processes them. EventLoop is the listener for the EventQueue. If NodeJS can process the request without I/O blocking then the event loop would itself process the request and sends the response back to the client by itself. But, it is possible to process multiple requests parallelly using the NodeJS cluster module or worker_threads module. The entire NodeJS architecture is not single-threaded. A single instance of Node.js runs in a single thread. If you have a multi-core system then you can utilize every core. The cluster module allows easy creation of child processes that all share the same server ports.",
        "img":"https://tsh.io/wp-content/uploads/2019/09/concurrency-nodejs_.png",
        "time":"2022-11-13T14:05:45.853Z"
    }
]