[
    {
      "title": "Couples Counseling",
      "des": "Couples therapy focuses on the pattern of interactions between two people, while allowing for the individual histories and contributions of each member. It is a treatment modality used in a variety of clinical situations—as part of a child evaluation (to assess the contribution of marital distress to a child's symptoms); in divorce mediation and child custody evaluations (to minimize the intensity of relational conflict that interferes with collaborative problem solving); in ongoing child and adolescent psychotherapy (when the parents' relationship is thought to play a part in a child's unhappiness); and as part of an ongoing family therapy (when the couple may be seen separately from the family as a whole). Couples therapy is often the treatment of choice for a range of problems: sexual dysfunction,1 alcohol and substance abuse,2 the disclosure of an infidelity,3 depression and anxiety disorders,4 infertility,5,6 serious medical illness,7 and parenting impasses.8 In addition, couples therapy may be helpful in the resolution of polarized relational issues (e.g., the decision to marry or divorce, the choice to have a child or an abortion, or the decision to move to another city for one partner's career). In this chapter, the term couples therapy is used rather than marital therapy so as to include therapy with homosexual couples and unmarried heterosexual couples.",
      "benifits": [
        "Improving communication skills between two people",
        "Discovering the root causes of major points of conflicts",
        "Creating better understanding",
        "Encouraging better acceptance of one another",
        "Providing the opportunity to increase shared support",
        "Restoring emotional and physical intimacy",
        "Decreasing emotional detachment or avoidance",
        "Restoring emotional strength and building relationship resilience",
        "Restoring lost trust between a couple",
        "Providing a secure environment and opportunity to heal."
      ],
      "price": "230",
      "rating": "4.5"
    }
]
